Table of Contents
 Interface IBimHostingFactory
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public interface IBimHostingFactory
Methods
 Create(IBIMPluginFactory, IPluginLogger)
IBIMPluginHosting Create(IBIMPluginFactory pluginFactory, IPluginLogger logger)
Parameters
pluginFactory IBIMPluginFactory
logger IPluginLogger
Returns
IBIMPluginHosting
 Edit this page